from utils import Gender

no_tense_words_hebrew = {
    "יסמין": {
        "He": [],
        "She": ["לינה", "יסמין"],
        "We": [],
        "I_F": [],
        "I_M": [],
    },
    "יסמין+מושא": {
        "He": [],
        "She": ["לינה", "יסמין"],
        "We": [],
        "I_F": ["לינה", "יסמין"],
        "I_M": [],
    },
    "עמוס": {
        "He": ["מיכאל", "עמוס"],
        "We": [],
        "She": [],
        "I_M": [],
        "I_F": []
    },
    "עמוס+מושא": {
        "He": ["מיכאל", "עמוס"],
        "We": ["מיכאל", "עמוס"],
        "She": [],
        "I_M": [],
        "I_F": []
    },
    "יובל+מושא": {
        "He": ["מיכאל", "עמוס"],
        "She": ["ירדן", "ענבר"],
        "We": [],
        "I_M": ["מיכאל", "עמוס"],
        "I_F": ["ירדן", "ענבר"],
    },
    "יובל": {
        "He": ["מיכאל", "עמוס"],
        "She": ["ירדן", "ענבר"],
        "We": [],
        "I_M": [],
        "I_F": [],
    },
    "שלו": {
        "I_M": ["שלי"],
        "I_F": ["שלי"],
        "She": ["שלה"],
        "We_M": ["שלנו"],
        "We_F": ["שלנו"],
        "He": ["שלו"]
    },
    "ממנו": {
        "I_M": ["ממני"],
        "I_F": ["ממני"],
        "She": ["ממנה"],
        "He": ["ממנו"],
        "We": ["מאיתנו"],
    },
    "למישהו": {
        "I_F": ["לי"],
        "I_M": ["לי"],
        "She": ["לה", "לאישה", "ליסמין"],
        "He": ["לו", "לילד", "לאמיר"],
        "We": ["לנו", "לנו"],
    },
    "במישהו": {
        "I_F": ["בי"],
        "I_M": ["בי"],
        "She": ["בה", "באישה", "ביסמין"],
        "He": ["בו", "בילד", "באמיר"],
        "We": ["בנו", "בנו"],
    },
    "עם+מישהו": {
        "I_F": ["איתי"],
        "I_M": ["איתי"],
        "She": ["איתה", "עם האישה", "עם יסמין"],
        "He": ["איתו", "עם הילד", "עם אמיר"],
        "We": ["איתנו", "איתנו"],
    },
    "את+מישהו": {
        "I_F": ["אותי"],
        "I_M": ["אותי"],
        "She": ["אותה", "את האישה", "את יסמין"],
        "He": ["אותו", "את הילד", "את אמיר"],
        "We": ["אותנו", "אותנו"],
    },
    "לו": {
        "I_M": ["לי"],
        "I_F": ["לי"],
        "She": ["לה"],
        "We": ["לנו"],
        "He": ["לו"]
    },
    "לעצמו":
        {
        "I_F": ["לעצמי"],
        "I_M": ["לעצמי"],
        "She": ["לעצמה"],
        "We": ["לעצמנו"],
        "He": ["לעצמו"]
        },
    "הוא": {
        "She": ["היא"],
        "He": ["הוא"],
        "We": ["אנחנו", "אנו"],
        "I_F": ["אני"],
        "I_M": ["אני"]
    },
    "מישהו": {
        "She": ["היא", "האישה", "יסמין"],
        "He": ["הוא", "הילד", "אמיר"],
        "We": ["אנחנו", "אנו"],
        "I_M": ["אני"],
        "I_F": ["אני"]
    },
    "שלמישהו": {
        "She": ["שלה", "של האישה", "של יסמין"],
        "He": ["שלו", "של הילד", "של אמיר"],
        "We": ["שלנו", "שלנו"],
        "I_F": ["שלי"],
        "I_M": ["שלי"]
    },
    "איזה+מישהו": {
        "She": ["אישה", "ילדה"],
        "He": ["איש", "ילד"],
        "We": [],
        "I_F": [],
        "I_M": []
    },
    "חפץ": {
        "She": ["מכונית", "מיטה"],
        "He": ["ארגז","מקרר", "סוס"],
        "We": [],
        "I_F": [],
        "I_M": []
    },
    "ו": {
        "He": ["ו"],
        "We": ["נו"],
        "She": ["ה"],
        "I_M": ["י"],
        "I_F": ["י"],
    },
    "בנו": {
        "He": ["בנו"],
        "She": ["בנה"],
        "I_M": ["בני"],
        "I_F": ["בני"],
        "We_M": ["בננו"]
    },
}

no_tense_words_english = {
    "Jasmine+obj": {
        "He": [],
        "She": ["Lina", "Jasmine"],
        "We": [],
        "I_F": ["Lina", "Jasmine"],
        "I_M": []
    },
    "Jasmine": {
        "He": [],
        "She": ["Lina", "Jasmine"],
        "We": [],
        "I_F": [],
        "I_M": []
    },
    "Amos+obj": {
        "He": ["Michael", "Amos"],
        "We": [],
        "She": [],
        "I_M": ["Michael", "Amos"],
        "I_F": []
    },
    "Amos": {
        "He": ["Michael", "Amos"],
        "We": [],
        "She": [],
        "I_M": [],
        "I_F": []
    },
    "Yuval+obj": {
        "He": ["Michael", "Amos"],
        "She": ["Yarden", "Inbar"],
        "We": [],
        "I_M": ["Michael", "Amos"],
        "I_F": ["Yarden", "Inbar"]
    },
    "Yuval": {
        "He": ["Michael", "Amos"],
        "She": ["Yarden", "Inbar"],
        "We": [],
        "I_M": [],
        "I_F": []
    },
    "someone":
        {
            "She": ["she", "the woman", "Jasmine"],
            "He": ["he", "the child", "Amir"],
            "We": ["we", "we"],
            "I_F": ["I"],
            "I_M": ["I"]
        },
    "someone+obj": {
        "I_F": ["me"],
        "I_M": ["me"],
        "She": ["her", "the woman", "Jasmine"],
        "He": ["him", "the child", "Amir"],
        "We": ["us", "us"],
    },
    "a+someone": {
        "She": ["a woman", "a girl"],
        "He": ["a man", "a boy"],
        "We": [],
        "I_F": [],
        "I_M": []
    },
    "physical+object": {
        "She": ["car", "bed"],
        "He": ["box", "refrigerator", "horse"],
        "We": [],
        "I_F": [],
        "I_M": []
    },
    "he":
        {
            "She": ["she"],
            "He": ["he"],
            "We": ["we", "we"],
            "I_M": ["I"],
            "I_F": ["I"]
        },
    "his":
        {
            "She": ["her"],
            "He": ["his"],
            "We": ["our"],
            "I_F": ["my"],
            "I_M": ["my"]
        },
    "him":
        {
            "She": ["her"],
            "He": ["him"],
            "We": ["us"],
            "I_M": ["me"],
            "I_F": ["me"]
        },
    "himself":  # Once we support suffixes, would could also represent by #_1_him _self.
        {
            "She": ["herself"],
            "He": ["himself"],
            "We": ["ourselves"],
            "I_M": ["myself"],
            "I_F": ["myself"]
        },
    "someone's": {
        "She": ["her", "the woman's", "Jasmine's"],
        "He": ["his", "the child's", "Amir's"],
        "We": ["our", "our"],
        "I_M": ["my"],
        "I_F": ["my"],
    },
}
tense_full_english = {
}

tense_full_hebrew = {
    "היה": {
        "PRESENT": {
            "She": [""],
            "He": [""],
            "We": [""],
            "I_M": [""],
            "I_F": [""]
        },
        "PAST": {
            "She": ["היתה"],
            "He": ["היה"],
            "We": ["הינו"],
            "I_M": ["הייתי"]
            , "I_F": ["הייתי"]
        },
        "FUTURE": {
            "She": ["תהיה"],
            "He": ["יהיה"],
            "We": ["נהיה"],
            "I_M": ["אהיה"],
            "I_F": ["אהיה"]
        },
    },
    "היה+יהיה": {
        "PRESENT": {
            "She": [""],
            "He": [""],
            "We": [""],
            "I_M": [""],
            "I_F": [""]
        },
        "PAST": {
            "She": ["היה"],
            "He": ["היה"],
            "We": ["היה"],
            "I_M": ["היה"]
            , "I_F": ["היה"]
        },
        "FUTURE": {
            "She": ["יהיה"],
            "He": ["יהיה"],
            "We": ["יהיה"],
            "I_M": ["יהיה"],
            "I_F": ["יהיה"]
        },
    },
    "היה+אין": {
        "PRESENT": {
            "She": ["אין"],
            "He": ["אין"],
            "We": ["אין"],
            "I_M": ["אין"],
            "I_F": ["אין"]
        },
        "PAST": {
            "She": ["לא היה"],
            "He": ["לא היה"],
            "We": ["לא היה"],
            "I_M": ["לא היה"],
            "I_F": ["לא היה"]
        },
        "FUTURE": {
            "She": ["לא יהיה"],
            "He": ["לא יהיה"],
            "We": ["לא יהיה"],
            "I_M": ["לא יהיה"],
            "I_F": ["לא יהיה"]
        },
    },
}
# Some aliases.
tense_full_hebrew["אין"] = tense_full_hebrew["היה+אין"]

gender_to_person = {
    Gender.HE: 3,
    Gender.SHE: 3,
    Gender.THEY: 3,
    Gender.I_F: 1,
    Gender.I_M: 1,
    Gender.WE_F: 1,
    Gender.WE_M: 1,
    Gender.YOU: 2
}